%%---------------------------Student Program1-----------------------------%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%简单%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% %  LabName:           DPSK调制解调实验
% %  Task:              1.生成长度为10的信源bit[1,0,0,1,1,0,0,1,1,0]，载波频
% %                      率1228800，进行DBPSK调制，加入信噪比为10dB的噪声并使
% %                       用相干解调法进行解调
% %                     2.统计误码数,绘制调制解调过程的波形图，将基带信号和已调
% %                         信号分别输出到示波器
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%---------------------------Student Program1 End-------------------------%%

len = 10; % 数据源长度
Fc = 1228800; %载波频率，单位Hz,载波频率配置需为Rb的整数倍,并且Fc小于fs/2
dataBit = [1 0 0 1 1 0 0 1 1 0];
